axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/inc/n32g401f8s7_1_gpio.h
/** GPIO Init Structure Definition **/
typedef struct
{
    uint32_t         Pin;            /* Specifies the GPIO pins to be configured. */

    uint32_t         GPIO_Mode;      /* Specifies the operating mode for the selected pins. */

    uint32_t         GPIO_Pull;      /* Specifies the Pull-up or Pull-Down activation for the selected pins. */

    uint32_t         GPIO_Slew_Rate; /* Specify the reverse speed for the selected pins. */

    uint32_t         GPIO_Current;   /* Driving current of the select pins. */

    uint32_t         GPIO_Alternate; /* Peripheral to be connected to the selected pins. */ 
}GPIO_InitType;

/** Bit_SET and Bit_RESET enumeration **/
typedef enum
{
    PIN_RESET = 0,
    PIN_SET
}Bit_CommandType;

/** GPIO_pins_define **/
#define GPIO_PIN_0           ((uint16_t)0x0001U) /* Pin 0 selected    */
#define GPIO_PIN_1           ((uint16_t)0x0002U) /* Pin 1 selected    */
#define GPIO_PIN_2           ((uint16_t)0x0004U) /* Pin 2 selected    */
#define GPIO_PIN_3           ((uint16_t)0x0008U) /* Pin 3 selected    */
#define GPIO_PIN_4           ((uint16_t)0x0010U) /* Pin 4 selected    */
#define GPIO_PIN_5           ((uint16_t)0x0020U) /* Pin 5 selected    */
#define GPIO_PIN_6           ((uint16_t)0x0040U) /* Pin 6 selected    */
#define GPIO_PIN_7           ((uint16_t)0x0080U) /* Pin 7 selected    */
#define GPIO_PIN_8           ((uint16_t)0x0100U) /* Pin 8 selected    */
#define GPIO_PIN_9           ((uint16_t)0x0200U) /* Pin 9 selected    */
#define GPIO_PIN_10          ((uint16_t)0x0400U) /* Pin 10 selected   */
#define GPIO_PIN_11          ((uint16_t)0x0800U) /* Pin 11 selected   */
#define GPIO_PIN_12          ((uint16_t)0x1000U) /* Pin 12 selected   */
#define GPIO_PIN_13          ((uint16_t)0x2000U) /* Pin 13 selected   */
#define GPIO_PIN_14          ((uint16_t)0x4000U) /* Pin 14 selected   */
#define GPIO_PIN_15          ((uint16_t)0x8000U) /* Pin 15 selected   */
#define GPIO_PIN_ALL         ((uint16_t)0xFFFFU) /* All pins selected */

/** GPIO Port Sources **/
#define GPIOA_PORT_SOURCE    ((uint8_t)0x00)
#define GPIOB_PORT_SOURCE    ((uint8_t)0x01)
#define GPIOD_PORT_SOURCE    ((uint8_t)0x03)

/** GPIO Pin Sources **/
#define GPIO_PIN_SOURCE0     ((uint8_t)0x00)
#define GPIO_PIN_SOURCE1     ((uint8_t)0x01)
#define GPIO_PIN_SOURCE2     ((uint8_t)0x02)
#define GPIO_PIN_SOURCE3     ((uint8_t)0x03)
#define GPIO_PIN_SOURCE4     ((uint8_t)0x04)
#define GPIO_PIN_SOURCE5     ((uint8_t)0x05)
#define GPIO_PIN_SOURCE6     ((uint8_t)0x06)
#define GPIO_PIN_SOURCE7     ((uint8_t)0x07)
#define GPIO_PIN_SOURCE8     ((uint8_t)0x08)
#define GPIO_PIN_SOURCE9     ((uint8_t)0x09)
#define GPIO_PIN_SOURCE10    ((uint8_t)0x0A)
#define GPIO_PIN_SOURCE11    ((uint8_t)0x0B)
#define GPIO_PIN_SOURCE12    ((uint8_t)0x0C)
#define GPIO_PIN_SOURCE13    ((uint8_t)0x0D)
#define GPIO_PIN_SOURCE14    ((uint8_t)0x0E)
#define GPIO_PIN_SOURCE15    ((uint8_t)0x0F)

/** EXTI external interrupt input source **/
#define AFIO_EXTI_PA0        (AFIO_EXTI_CFG1_EXTI0_PA0)
#define AFIO_EXTI_PD0        (AFIO_EXTI_CFG1_EXTI0_PD0)
#define AFIO_EXTI_PA1        (AFIO_EXTI_CFG1_EXTI0_PA1)
#define AFIO_EXTI_PB1        (AFIO_EXTI_CFG1_EXTI0_PB1)
#define AFIO_EXTI_PA2        (AFIO_EXTI_CFG1_EXTI0_PA2)
#define AFIO_EXTI_PA3        (AFIO_EXTI_CFG1_EXTI0_PA3)

#define AFIO_EXTI_PA4        (AFIO_EXTI_CFG1_EXTI0_PA4)
#define AFIO_EXTI_PA5        (AFIO_EXTI_CFG1_EXTI0_PA5)
#define AFIO_EXTI_PA6        (AFIO_EXTI_CFG1_EXTI0_PA6)
#define AFIO_EXTI_PA7        (AFIO_EXTI_CFG1_EXTI0_PA7)

#define AFIO_EXTI_PA9        (AFIO_EXTI_CFG1_EXTI0_PA9)
#define AFIO_EXTI_PA10       (AFIO_EXTI_CFG1_EXTI0_PA10)

#define AFIO_EXTI_PA13       (AFIO_EXTI_CFG1_EXTI0_PA13)
#define AFIO_EXTI_PA14       (AFIO_EXTI_CFG1_EXTI0_PA14)
#define AFIO_EXTI_PD14       (AFIO_EXTI_CFG1_EXTI0_PD14)
#define AFIO_EXTI_PD15       (AFIO_EXTI_CFG1_EXTI0_PD15)

/** EXTI line define **/
#define EXTI_LINE_0   ((uint16_t)0x0001U) /* EXTI0  */
#define EXTI_LINE_1   ((uint16_t)0x0002U) /* EXTI1  */
#define EXTI_LINE_2   ((uint16_t)0x0004U) /* EXTI2  */
#define EXTI_LINE_3   ((uint16_t)0x0008U) /* EXTI3  */
#define EXTI_LINE_4   ((uint16_t)0x0010U) /* EXTI4  */
#define EXTI_LINE_5   ((uint16_t)0x0020U) /* EXTI5  */
#define EXTI_LINE_6   ((uint16_t)0x0040U) /* EXTI6  */
#define EXTI_LINE_7   ((uint16_t)0x0080U) /* EXTI7  */
#define EXTI_LINE_8   ((uint16_t)0x0100U) /* EXTI8  */
#define EXTI_LINE_9   ((uint16_t)0x0200U) /* EXTI9  */
#define EXTI_LINE_10  ((uint16_t)0x0400U) /* EXTI10 */
#define EXTI_LINE_11  ((uint16_t)0x0800U) /* EXTI11 */
#define EXTI_LINE_12  ((uint16_t)0x1000U) /* EXTI12 */
#define EXTI_LINE_13  ((uint16_t)0x2000U) /* EXTI13 */
#define EXTI_LINE_14  ((uint16_t)0x4000U) /* EXTI14 */
#define EXTI_LINE_15  ((uint16_t)0x8000U) /* EXTI15 */
#define EXTI_LINE_ALL ((uint16_t)0xFFFFU) /* All EXTI line */

/** EXTI line sources **/
#define EXTI_LINE_SOURCE0    ((uint8_t)0x00) /* EXTI_line_0  */
#define EXTI_LINE_SOURCE1    ((uint8_t)0x01) /* EXTI_line_1  */
#define EXTI_LINE_SOURCE2    ((uint8_t)0x02) /* EXTI_line_2  */
#define EXTI_LINE_SOURCE3    ((uint8_t)0x03) /* EXTI_line_3  */
#define EXTI_LINE_SOURCE4    ((uint8_t)0x04) /* EXTI_line_4  */
#define EXTI_LINE_SOURCE5    ((uint8_t)0x05) /* EXTI_line_5  */
#define EXTI_LINE_SOURCE6    ((uint8_t)0x06) /* EXTI_line_6  */
#define EXTI_LINE_SOURCE7    ((uint8_t)0x07) /* EXTI_line_7  */
#define EXTI_LINE_SOURCE8    ((uint8_t)0x08) /* EXTI_line_8  */
#define EXTI_LINE_SOURCE9    ((uint8_t)0x09) /* EXTI_line_9  */
#define EXTI_LINE_SOURCE10   ((uint8_t)0x0A) /* EXTI_line_10 */
#define EXTI_LINE_SOURCE11   ((uint8_t)0x0B) /* EXTI_line_11 */
#define EXTI_LINE_SOURCE12   ((uint8_t)0x0C) /* EXTI_line_12 */
#define EXTI_LINE_SOURCE13   ((uint8_t)0x0D) /* EXTI_line_13 */
#define EXTI_LINE_SOURCE14   ((uint8_t)0x0E) /* EXTI_line_14 */
#define EXTI_LINE_SOURCE15   ((uint8_t)0x0F) /* EXTI_line_15 */

/** Filter stage control define **/
#define AFIO_IOFITCFG        ((uint8_t)0x00)

/** AFIO EFT sources **/
#define AFIO_PA0_EFT         (AFIO_EFT_CFG1_PA0EFTEN)      
#define AFIO_PA1_EFT         (AFIO_EFT_CFG1_PA1EFTEN)   
#define AFIO_PA2_EFT         (AFIO_EFT_CFG1_PA2EFTEN)   
#define AFIO_PA3_EFT         (AFIO_EFT_CFG1_PA3EFTEN)    
#define AFIO_PA4_EFT         (AFIO_EFT_CFG1_PA4EFTEN)    
#define AFIO_PA5_EFT         (AFIO_EFT_CFG1_PA5EFTEN)    
#define AFIO_PA6_EFT         (AFIO_EFT_CFG1_PA6EFTEN)    
#define AFIO_PA7_EFT         (AFIO_EFT_CFG1_PA7EFTEN)    
#define AFIO_PA9_EFT         (AFIO_EFT_CFG1_PA9EFTEN)      
#define AFIO_PA10_EFT        (AFIO_EFT_CFG1_PA10EFTEN)    
#define AFIO_PA13_EFT        (AFIO_EFT_CFG1_PA13EFTEN)    
#define AFIO_PA14_EFT        (AFIO_EFT_CFG1_PA14EFTEN)   
#define AFIO_PB1_EFT         (AFIO_EFT_CFG1_PB1EFTEN)   
#define AFIO_PD0_EFT         (AFIO_EFT_CFG2_PD0EFTEN)    
#define AFIO_PD14_EFT        (AFIO_EFT_CFG2_PD14EFTEN)    
#define AFIO_PD15_EFT        (AFIO_EFT_CFG2_PD15EFTEN)  

/** AFIO DIGEFT sources **/
#define AFIO_PA0_DIGEFT      (AFIO_DIGEFT_CFG1_PA0EFTEN)       
#define AFIO_PA1_DIGEFT      (AFIO_DIGEFT_CFG1_PA1EFTEN)    
#define AFIO_PA2_DIGEFT      (AFIO_DIGEFT_CFG1_PA2EFTEN)    
#define AFIO_PA3_DIGEFT      (AFIO_DIGEFT_CFG1_PA3EFTEN)     
#define AFIO_PA4_DIGEFT      (AFIO_DIGEFT_CFG1_PA4EFTEN)     
#define AFIO_PA5_DIGEFT      (AFIO_DIGEFT_CFG1_PA5EFTEN)     
#define AFIO_PA6_DIGEFT      (AFIO_DIGEFT_CFG1_PA6EFTEN)     
#define AFIO_PA7_DIGEFT      (AFIO_DIGEFT_CFG1_PA7EFTEN)     
#define AFIO_PA9_DIGEFT      (AFIO_DIGEFT_CFG1_PA9EFTEN)       
#define AFIO_PA10_DIGEFT     (AFIO_DIGEFT_CFG1_PA10EFTEN)    
#define AFIO_PA13_DIGEFT     (AFIO_DIGEFT_CFG1_PA13EFTEN)    
#define AFIO_PA14_DIGEFT     (AFIO_DIGEFT_CFG1_PA14EFTEN)   
#define AFIO_PB1_DIGEFT      (AFIO_DIGEFT_CFG1_PB1EFTEN)    
#define AFIO_PD0_DIGEFT      (AFIO_DIGEFT_CFG2_PD0EFTEN)     
#define AFIO_PD14_DIGEFT     (AFIO_DIGEFT_CFG2_PD14EFTEN)    
#define AFIO_PD15_DIGEFT     (AFIO_DIGEFT_CFG2_PD15EFTEN)  

/** Port pin 5V tolerance enable mask **/
#define PA0_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA0TOLENN)
#define PA1_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA1TOLENN)
#define PA2_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA2TOLENN)
#define PA3_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA3TOLENN)
#define PA4_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA4TOLENN)
#define PA5_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA5TOLENN)
#define PA6_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA6TOLENN)
#define PA7_5V_TOLERANCE     (AFIO_5VTOL_CFG_PA7TOLENN)
#define PB1_5V_TOLERANCE     (AFIO_5VTOL_CFG_PB1TOLENN)

/** GPIOx_Alternate_function_selection Alternate function selection **/

/** Alternate function AF0 **/
#define ALTERNATE_FUN_0      ((uint8_t)0x00U)
#define GPIO_AF0_SWDIO       (ALTERNATE_FUN_0) /* SWDIO Alternate Function mapping    */
#define GPIO_AF0_SWCLK       (ALTERNATE_FUN_0) /* SWCLK Alternate Function mapping    */

/** Alternate function AF1 **/
#define ALTERNATE_FUN_1      ((uint8_t)0x01U)
#define GPIO_AF1_SPI1        (ALTERNATE_FUN_1) /* SPI1 Alternate Function mapping     */
#define GPIO_AF1_SPI2        (ALTERNATE_FUN_1) /* SPI2 Alternate Function mapping     */
#define GPIO_AF1_TIM8        (ALTERNATE_FUN_1) /* TIM8 Alternate Function mapping     */
#define GPIO_AF1_UART1       (ALTERNATE_FUN_1) /* UART1 Alternate Function mapping    */

/** Alternate function AF2 **/
#define ALTERNATE_FUN_2      ((uint8_t)0x02U)
#define GPIO_AF2_TIM5        (ALTERNATE_FUN_2) /* TIM5 Alternate Function mapping     */
#define GPIO_AF2_TIM1        (ALTERNATE_FUN_2) /* TIM1 Alternate Function mapping     */
#define GPIO_AF2_UART1       (ALTERNATE_FUN_2) /* UART1 Alternate Function mapping    */
#define GPIO_AF2_SPI2        (ALTERNATE_FUN_2) /* SPI2 Alternate Function mapping     */

/** Alternate function AF3 **/
#define ALTERNATE_FUN_3      ((uint8_t)0x03U)
#define GPIO_AF3_TIM2        (ALTERNATE_FUN_3) /* TIM2 Alternate Function mapping     */
#define GPIO_AF3_SPI2        (ALTERNATE_FUN_3) /* SPI2 Alternate Function mapping     */
#define GPIO_AF3_TIM3        (ALTERNATE_FUN_3) /* TIM3 Alternate Function mapping     */
#define GPIO_AF3_TIM1        (ALTERNATE_FUN_3) /* TIM1 Alternate Function mapping     */

/** Alternate function AF4 **/
#define ALTERNATE_FUN_4      ((uint8_t)0x04U)
#define GPIO_AF4_EVENTOUT    (ALTERNATE_FUN_4) /* EVENTOUT Alternate Function mapping */
#define GPIO_AF4_USART2      (ALTERNATE_FUN_4) /* USART2 Alternate Function mapping   */

/** Alternate function AF5 **/
#define ALTERNATE_FUN_5      ((uint8_t)0x05U)
#define GPIO_AF5_USART2      (ALTERNATE_FUN_5) /* USART2 Alternate Function mapping   */
#define GPIO_AF5_UART1       (ALTERNATE_FUN_5) /* UART1 Alternate Function mapping    */
#define GPIO_AF5_SPI1        (ALTERNATE_FUN_5) /* SPI1 Alternate Function mapping     */

/** Alternate function AF6 **/
#define ALTERNATE_FUN_6      ((uint8_t)0x06U)
#define GPIO_AF6_TIM2        (ALTERNATE_FUN_6) /* TIM2 Alternate Function mapping     */
#define GPIO_AF6_I2C2        (ALTERNATE_FUN_6) /* I2C2 Alternate Function mapping     */
#define GPIO_AF6_TIM4        (ALTERNATE_FUN_6) /* TIM4 Alternate Function mapping     */
#define GPIO_AF6_TIM1        (ALTERNATE_FUN_6) /* TIM1 Alternate Function mapping     */
#define GPIO_AF6_SPI2        (ALTERNATE_FUN_6) /* SPI2 Alternate Function mapping     */

/** Alternate function AF7 **/
#define ALTERNATE_FUN_7      ((uint8_t)0x07U)
#define GPIO_AF7_TIM5        (ALTERNATE_FUN_7) /* TIM5 Alternate Function mapping     */
#define GPIO_AF7_TIM8        (ALTERNATE_FUN_7) /* TIM8 Alternate Function mapping     */
#define GPIO_AF7_I2C2        (ALTERNATE_FUN_7) /* I2C2 Alternate Function mapping     */
#define GPIO_AF7_UART4       (ALTERNATE_FUN_7) /* UART4 Alternate Function mapping    */

